# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-FastViT-cls: FastViT (arXiv:2303.14189) RepMixer stages 1-3 + MHSA stage 4.
# Blocks in ultralytics/nn/modules/vit_blocks.py. Inject before model build: `import callbacks.vit_modules`.

# Parameters
nc: 1000 # number of classes

scales:
  # [depth, width, max_channels]
  s: [1.0, 0.50, 1024] # target ~5-7M params (FastViT-T analog, 1.39ms bs=1 fp16 target)
  l: [5.0, 0.75, 1024] # target ~14-16M params (deeper stages, same width as s×1.5)

# FastViT backbone: 4 stages @ strides 4/8/16/32 with downsample conv between stages
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [96, 3, 2]] # 0 P1/2  stem conv1 (96*width channels)
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4  stem conv2
  - [-1, 2, FastViTBlock, [3]] # 2 stage1 @ P2/4  (depth*n blocks, mlp_ratio=3)
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8  downsample
  - [-1, 2, FastViTBlock, [3]] # 4 stage2 @ P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16  downsample
  - [-1, 2, FastViTBlock, [3]] # 6 stage3 @ P4/16
  - [-1, 1, Conv, [768, 3, 2]] # 7 P5/32  downsample
  - [-1, 1, MHSABlock, [6, 4]] # 8 stage4 @ P5/32  heads=6, mlp_ratio=4

# Head
head:
  - [-1, 1, Classify, [nc]] # 9 AdaptiveAvgPool + Conv1x1 + Linear
